Autodesk.Revit.DB.DataExchangeMessageSeverity
Error levels for DataExchangeLog
Since:
2016
Since:
2016

Autodesk.Revit.DB.DataExchangeMessageSeverity.FatalError
A serious problem that makes further data conversion pointless. The conversion process will be cancelled.

Autodesk.Revit.DB.DataExchangeMessageSeverity.Error
A problem.  The converted data should be carefully examined and/or compared to the source data. The application may want to cancel the conversion process.

Autodesk.Revit.DB.DataExchangeMessageSeverity.Warning
A potential problem. The converted data should be carefully examined and/or compared to the source data

Autodesk.Revit.DB.DataExchangeMessageSeverity.Info
Informational message, such as successful creation fo a face, edge or a solid.